models/User.php

    public static function findIdentity($id)
    {
         $user = User::find()
            ->where(['id' => $id])
            ->one();
---
SELECT * FROM `user` WHERE `id`=1

    public static function findByUsername($username)
    {
        $user = User::find()
            ->where(['username' => $username])
            ->one();
---
SELECT * FROM `user` WHERE `username`='jcedeno'